app/views/pedido_produtos/_form.html.erb


      <%= f.collection_select(:produto_id, Produto.all, :id, :nome, {}, {class: "form-control"}) %>
---
SELECT `tipo_produtos`.* FROM `tipo_produtos`