app/views/pedidos/_form.html.erb

    <div class="col-sm-10">
      <%= f.collection_select(:cliente_id, Cliente.all, :id, :nome, {}, {class: "form-control"}) %>
---
SELECT `clientes`.* FROM `clientes`