app/views/produtos/_form.html.erb

    <div class="col-sm-10">
     <%= f.collection_select(:tipo_produto_id, TipoProduto.all, :id, :nome, {}, {class: "form-control"}) %>
---
SELECT `tipo_produtos`.* FROM `tipo_produtos`