app/controllers/admnistradors_controller.rb

SELECT `admnistradors`.* FROM `admnistradors`
---
  def index
    @admnistradors = Admnistrador.all

INSERT INTO `admnistradors` (`id`, `nome`, `email`, `senha`, `created_at`, `updated_at`) VALUES ('9d289658-e291-4564-b832-cc60b75660fd', 'Bruno Neville Ribeiro Santos', 'brunoneville31@gmail.com', '123456', '2020-01-29 11:40:29', '2020-01-29 11:40:29')
---
  def create
    @admnistrador = Admnistrador.new(admnistrador_params)

    respond_to do |format|
      if @admnistrador.save

SELECT  `admnistradors`.* FROM `admnistradors` WHERE `admnistradors`.`id` = '9d289658-e291-4564-b832-cc60b75660fd' LIMIT 1
---
    def set_admnistrador
      @admnistrador = Admnistrador.find(params[:id])