app/controllers/application_controller.rb

	def valida_logado_admin
		if cookies[:comidaboa_admin].present?
			hash_admin = JSON.parse(cookies[:comidaboa_admin])
			if hash_admin["id"].present?
				admnistradores = Admnistrador.where(id: hash_admin["id"])
				if admnistradores.count > 0
					@admnistrador = admnistradores.first
---
SELECT COUNT(*) FROM `admnistradors` WHERE `admnistradors`.`id` = '1489a1d0-ae12-4278-80fa-c8d2a7c86e90'
SELECT  `admnistradors`.* FROM `admnistradors` WHERE `admnistradors`.`id` = '1489a1d0-ae12-4278-80fa-c8d2a7c86e90' ORDER BY `admnistradors`.`id` ASC LIMIT 1