app/controllers/clientes_controller.rb

SELECT `clientes`.* FROM `clientes`
---
  def index
    @clientes = Cliente.all

INSERT INTO `clientes` (`id`, `nome`, `cpf`, `telefone`, `email`, `endereco`, `numero`, `bairro`, `cidade`, `estado`, `cep`, `created_at`, `updated_at`) VALUES ('0f1434cf-b11c-4e75-84fd-d315616eef5b', 'Bruno Neville Ribeiro Santos', '05553514169', '62986299727', 'brunoneville31@gmail.com', 'Rua Francisco Godinho', 'Vila Rosa', '', 'Goiânia', 'Goiás', '74345-220', '2020-01-28 22:39:34', '2020-01-28 22:39:34')
---
  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save

SELECT  `clientes`.* FROM `clientes` WHERE `clientes`.`id` = '0f1434cf-b11c-4e75-84fd-d315616eef5b' LIMIT 1
---
    def set_cliente
      @cliente = Cliente.find(params[:id])