app/controllers/ecommerce_controller.rb

	def index
		@produto = Produto.find(params[:produto_id])
---
SELECT  `produtos`.* FROM `produtos` WHERE `produtos`.`id` = '3ffdaaad-92da-4a11-a86e-c7dfe215310b' LIMIT 1

	def carrinho
		if cookies[:carrinho].blank?
			redirect_to '/'
			return
		end

		produtos = JSON.parse(cookies[:carrinho]);
		@produto = Produto.where(id: produtos)
---
SELECT `produtos`.* FROM `produtos` WHERE `produtos`.`id` IN ('3ffdaaad-92da-4a11-a86e-c7dfe215310b', '580d3040-9adf-477b-ab83-0e49a77789b8')

	def fechar_carrinho
		if cookies[:cliente_login].blank?
			redirect_to '/cliente/login'
		return
		end

		if cookies[:carrinho].blank?
			redirect_to '/'
			return
		end

		produtos = JSON.parse(cookies[:carrinho]);
		@produto = Produto.where(id: produtos)
---
SELECT `produtos`.* FROM `produtos` WHERE `produtos`.`id` IN ('3ffdaaad-92da-4a11-a86e-c7dfe215310b', '580d3040-9adf-477b-ab83-0e49a77789b8')

	def cadastrar_cliente
		@cliente = Cliente.new(cliente_params)

			if @cliente.save
---
INSERT INTO `clientes` (`id`, `nome`, `cpf`, `telefone`, `email`, `endereco`, `numero`, `bairro`, `cidade`, `estado`, `cep`, `created_at`, `updated_at`, `senha`) VALUES ('e8e645d9-c408-4233-b5f6-cd3629698ed0', 'Bruno Neville Ribeiro Santos', '147258', '62986299727', '321@321.com', 'Rua Francisco Godinho', 'Vila Rosa', '', 'Goiânia', 'Goiás', '74345-220', '2020-01-29 19:09:40', '2020-01-29 19:09:40', '123456')