app/controllers/home_controller.rb

SELECT `tipo_produtos`.* FROM `tipo_produtos`
SELECT `produtos`.* FROM `produtos` WHERE `produtos`.`tipo_produto_id` = '4c950967-7c74-47f3-adbe-7c436465d72e'
SELECT  `produtos`.* FROM `produtos` WHERE `produtos`.`tipo_produto_id` = '4c950967-7c74-47f3-adbe-7c436465d72e' LIMIT 9 OFFSET 0
SELECT COUNT(*) FROM `produtos`
---
	def index
		@produtos = Produto.all
		@produtos = @produtos.where(tipo_produto_id: params[:tipo_produto]) if params[:tipo_produto].present?
		options = {page: params[:page] || 1, per_page: 9}
		@produtos = @produtos.paginate(options)