app/controllers/login_controller.rb

	def logar
		admnistradores = Admnistrador.where(email: params[:email], senha: params[:senha])
		if admnistradores.count > 0
			admnistrador = admnistradores.first
---
SELECT  `admnistradors`.* FROM `admnistradors` WHERE `admnistradors`.`email` = '123@123.com' AND `admnistradors`.`senha` = '123456' ORDER BY `admnistradors`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `admnistradors` WHERE `admnistradors`.`email` = 'brunoneville31@gmail.com' AND `admnistradors`.`senha` = 'senha'