app/controllers/pedido_produtos_controller.rb

SELECT `pedido_produtos`.* FROM `pedido_produtos` WHERE `pedido_produtos`.`pedido_id` = 'e60edaac-9382-495a-ab61-e1b730a35b2e'
---
  def index
    @pedido_produtos = PedidoProduto.where(pedido_id: @pedido.id)

INSERT INTO `pedido_produtos` (`id`, `pedido_id`, `valor`, `quantidade`, `produto_id`, `created_at`, `updated_at`) VALUES ('a498cc9a-38a9-47b4-80b3-3ff8ab65592c', 'e60edaac-9382-495a-ab61-e1b730a35b2e', 2.0, 1, '703dfe5a-d72b-493f-a720-795d58621848', '2020-01-29 02:42:27', '2020-01-29 02:42:27')
---
  def create
    @pedido_produto = PedidoProduto.new(pedido_produto_params)
    @pedido_produto.pedido = @pedido

    respond_to do |format|
      if @pedido_produto.save

SELECT  `pedidos`.* FROM `pedidos` WHERE `pedidos`.`id` = '5d995d73-9ce2-4e0e-9408-995a62db3fc7' LIMIT 1
---
    def set_pedido
      @pedido = Pedido.find(params[:pedido_id])

SELECT  `produtos`.* FROM `produtos` WHERE `produtos`.`id` = '703dfe5a-d72b-493f-a720-795d58621848' LIMIT 1
SELECT  `pedido_produtos`.* FROM `pedido_produtos` WHERE `pedido_produtos`.`id` = '54b1f3b9-2065-419d-a790-6caa2a95f473' LIMIT 1
---
    def set_pedido_produto
      @pedido_produto = PedidoProduto.find(params[:id])