app/controllers/produtos_controller.rb

SELECT `produtos`.* FROM `produtos`
---
  def index
    @produtos = Produto.all

INSERT INTO `produtos` (`id`, `nome`, `descricao`, `quantidade`, `tipo_produto_id`, `valor`, `created_at`, `updated_at`, `imagem`) VALUES ('c3b7135d-c4c4-4d46-a8d4-eb3084a6efe0', 'Promoção do Dia', 'Mega Lanche  Que tem como opcional batata e Queijo', 50, '4c950967-7c74-47f3-adbe-7c436465d72e', 10.0, '2020-01-29 14:23:16', '2020-01-29 14:23:16', 'https://cdn.panelinha.com.br/receita/1562096945621-receita.jpg')
---
  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save

UPDATE `produtos` SET `imagem` = 'http://s2.glbimg.com/liMYyeWI1lfffovI940qbaHxyf0=/640x413/smart/e.glbimg.com/og/ed/f/original/2017/05/24/x-salada-lanchonete-cidade.jpg', `tipo_produto_id` = '4c950967-7c74-47f3-adbe-7c436465d72e', `updated_at` = '2020-01-29 14:29:34' WHERE `produtos`.`id` = '580d3040-9adf-477b-ab83-0e49a77789b8'
---
  def update
    respond_to do |format|
      if @produto.update(produto_params)

SELECT  `produtos`.* FROM `produtos` WHERE `produtos`.`id` = 2 LIMIT 1
---
    def set_produto
      @produto = Produto.find(params[:id])