app/views/layouts/site.html.erb

SELECT `tipo_produtos`.* FROM `tipo_produtos`
---
        <div class="list-group">
          <% TipoProduto.all.each do |categoria| %>